local _, C, _, _ = unpack(select(2, ...))

-- 法术白名单
C.WhiteList = {
	-- 职业长控
	[   339]	= true,		-- 纠缠根须
	[102359]	= true,		-- 群体缠绕
	[217832]	= true,		-- 禁锢
	[207685]	= true,		-- 悲苦咒符
	[   118]	= true,		-- 变形术
	[ 28271]	= true,		-- 变形术
	[ 28272]	= true,		-- 变形术
	[ 61305]	= true,		-- 变形术
	[ 61721]	= true,		-- 变形术
	[ 61780]	= true,		-- 变形术
	[126819]	= true,		-- 变形术
	[161353]	= true,		-- 变形术
	[161354]	= true,		-- 变形术
	[161355]	= true,		-- 变形术
	[161372]	= true,		-- 变形术
	[  3355]	= true,		-- 冰冻陷阱
	[ 19386]	= true,		-- 翼龙钉刺
	[  9484]	= true,		-- 束缚亡灵
	[  6770]	= true,		-- 闷棍
	[  2094]	= true,		-- 致盲
	[ 51514]	= true,		-- 妖术
	[210873]	= true,		-- 妖术
	[211004]	= true,		-- 妖术
	[211010]	= true,		-- 妖术
	[211015]	= true,		-- 妖术
	[ 20066]	= true,		-- 忏悔
	[   710]	= true,		-- 放逐术
	[115078]	= true,		-- 分筋错骨
	-- 种族技能
	[ 28730]	= true,		-- 奥术洪流
	[ 20549]	= true,		-- 战争践踏
	[107079]	= true,		-- 震山掌
	-- 秘境
	[226510]	= true,		-- 血池
	[229495]	= true,		-- 象棋易伤
	[226285]	= true,		-- 恶魔飞升
	-- 副本
	[207327]	= true,		-- 净化毁灭，崔利艾克斯
	[236513]	= true,		-- 骨牢护甲，聚合体小怪
	[240315]	= true,		-- 硬化之壳，哈亚坦蛋盾
	[241521]	= true,		-- 折磨碎片，M审判庭小怪
	[250074]	= true,		-- 净化，艾欧娜尔
	[250555]	= true,		-- 邪能护盾，艾欧娜尔
	[246504]	= true,		-- 程式启动，金加洛斯
	[249863]	= true,		-- 泰坦的面容，破坏魔女巫会
	[244903]	= true,		-- 催化作用，阿格拉玛
	[253021]	= true,		-- 宿命，寂灭者阿古斯
	[255496]	= true,		-- 宇宙之剑，寂灭者阿古斯
	[255478]	= true,		-- 永恒之刃，寂灭者阿古斯
	[255418]	= true,		-- 物理易伤，寂灭者阿古斯
	[255425]	= true,		-- 冰霜易伤，寂灭者阿古斯
	[255430]	= true,		-- 暗影易伤，寂灭者阿古斯
	[255429]	= true,		-- 火焰易伤，寂灭者阿古斯
	[255419]	= true,		-- 神圣易伤，寂灭者阿古斯
	[255422]	= true,		-- 自然易伤，寂灭者阿古斯
	[255433]	= true,		-- 奥术易伤，寂灭者阿古斯
}

-- 法术黑名单
C.BlackList = {
	[ 15407]	= true,		-- 精神鞭笞
	[240606]	= true,		-- 鸟德神器
	[240607]	= true,		-- 鸟德神器
}
